Revit 2024 API
BuiltInFailures.SketchFailures.InvalidRoofCurveloopError Property
 Base sketch for roof is invalid
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId InvalidRoofCurveloopError { get; }
Visual Basic
Public Shared ReadOnly Property InvalidRoofCurveloopError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ InvalidRoofCurveloopError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace